export const experience = [
  {
    id: 1,
    data: "10.2023 - по настоящее время",
    post: "web разработчик",
    company: "ООО 'Аврора'",
    site: "https://arbq.ru/",
    duties: "Разработка и поддержание работы сайтов компании, расширение функционала, поддержка и модернизация текущих проектов. Создание новых сайтов.\nОптимизация существующего кода и его рефакторинг, оптимизация загрузки сайтов, создание функциональных динамических элементов различного рода. В работе использовал следующий стек: JavaScript, CSS, SCSS, TailwindCSS, HTML, React, Node.JS, PHP, MySQL, PostgreSQL, MODX, OpenCart.",
    achievements: "<ul><li>Разработал сайты компании (hyva-ru.ru, upsen.su, forst.su, zoty.ru, шредер-промышленный.рф)</li><li>Разработал взаимодействие базы данных сайта zoty.ru и arbq.ru с google таблицами, что позволяет содержать всегда актуальную информацию о продукции на сайте</li><li>Создал базу файлов для динамически формируемых страниц коммерческих предложений продаваемой продукции на базе сайта zoty.ru</li><li>Доработал функционал сайтов arbq.ru и zoty.ru</li><li>Создал динамически заполняемый электронный каталог продукции на основе базы данных сайта zoty.ru</li></ul><div class='page-break'>" 
  },
  {
    id: "2",
    data: "05.2023 - 07.2023",
    post: "Стажер по Frontend-разработке (Angular)",
    company: "Лига Цифровой Экономики, Москва",
    site: "https://www.digitalleague.ru/",
    duties: "Frontend-разработка веб-приложения с использованием фреймворка Angular. <p>Стек технологий: JavaScript, TypeScript, фреймворк Angular с встроенной библиотекой RxJS, препроцессор SCSS и библиотека Angular Material.</p>",
    achievements:"<ul>\n<li>\nРазработал приложение с использованием средств реактивной парадигмы - Observable, Subjects и RxJs пайпов и операторов.\n</li>\n<li>\nВ приложении реализовал аутентификацию и авторизацию, реализовал защиту страниц приложения с использованием guards и интерсепторов.\n</li>\n<li>\nНастроил роутинг страниц.\n</li>\n<li>\nВ разработке примененял реактивные формы с валидацией.</li><li>Изучил преобразование потоков данных, организовал рефреш данных. Разработал несколько проектов и защитил итоговый рабочий проект MeetUps.</li></ul><p>Приложение MeetUps представляет из себя список мероприятий в котором реализован поиск митапов (встречь) по своим интересам с возможностью зарегистрироваться на участие в них. Также приложение позволяет создавать и редактировать планируемые встречи.</p><p>Ссылка на репозиторий: <a href=\"https://github.com/Andrey-A-A/liga-meetups\">https://github.com/Andrey-A-A/liga-meetups</a></p>"
  },
  {
    id: "3",
    data: "09.2022 - 03.2023",
    post: "Frontend разработчик (обучение)",
    company: "Яндекс Практикум",
    site: "https://practicum.yandex.ru/middle-frontend/",
    duties: "<i>Самостоятельная разработка проекта \"Веб-мессенджер\"</i> <br/>\n\
    Стек технологий:<br/>JavaScript, TypeScript, шаблонизатор Handlebars, SCSS, клиент-серверное взаимодействие HTTP, REST, Webpack, NodeJS, Express, XMLHttpRequest, ESlint, WebSocket, Jest, Docker<br/><br/>\n\
    <span>Разработка командного проекта 'Веб-игра'</span><br/>\n\
    Стек технологий:<br/>\n\
    TypeScript, React, Redux, Vite, Canvas API, Jest, SSR, NodeJS, Express, Docker, PostgeSQL, nginx<div class='page-break'></div>",
    achievements:"<p>\n'Веб-мессенджер'\n</p>\n<ul>\n<li>\nВ приложении реализовал регистрацию, авторизацию, изменение данных профиля с валидацией\n</li>\n<li>\nРеализовал создание чатов, добавление и удаление других пользователей из чата и обмен сообщениями в режиме real-time с использованием WebSocket.\n</li>\n<li>\nНастроил роутинг страниц.\n</li>\n</ul>\n<p>\nСсылка на репозиторий: <a href='https://github.com/Andrey-A-A/middle.messenger.praktikum.yandex'>https://github.com/Andrey-A-A/middle.messenger.praktikum.yandex</a>\n</p><br/>\n<p>\n'Веб-игра'\n</p>\n<ul>\n<li>\nНастроил в приложениии работу стейт менеджера Redux (использовал библиотеку Redux Toolkit)\n</li>\n<li>\nВ приложении реализовал работу форума\n</li>\n<li>\nРеализовал авторизацию/регистрацию, изменение профиля авторизованного пользователя\n</li>\n<li>\nОбеспечил защиту от XSS атак\n</li>\n</ul>\n<p>\nСсылка на репозиторий: <a href='https://github.com/wordrunners/bumble'>https://github.com/wordrunners/bumble</a>\n</p>",
  },
  {
    id: "4",
    data: "12.2010 - 08.2021",
    post: "Frontend разработчик / Web разработчик",
    company: "интернет-магазин Nail-Body",
    site: "https://nail-body.ru",
    duties: "Разработка и поддержание работы сайта интернет-магазина.<br/>\n\
    Также помимо создания и администрирования сайта интернет-магазина занимался seo-продвижением, контекстной рекламой, осуществлял управление интернет-магазином.<br/>\n\
    В работе использовались технологии - HTML5, CSS3, JavaScript, PHP, AJAX. Использовал адаптивную и кроссбраузерную верстку.",
    achievements:"<ul><li>В ходе моей работы в интернет-магазине создал с нуля самописный движок для полноценного функционала интернет магазина и динамического формирования страниц сайта на основе текстовой базы данных.</li><li>Долгие годы удавалось продвигать сайт на первые позиции в поисковых системах за счет внутренней и внешней SEO оптимизации</li></ul><div class='page-break'></div>",
  }
]

